SMSServerGui/app/controllers/outgoing_sms_number_groups_controller.rb

SELECT * FROM `outgoing_sms_number_groups` ORDER BY created_at LIMIT 0, 5
---
  def index
    @outgoing_sms_number_groups = OutgoingSmsNumberGroup.paginate( :all,:page => params[ :page ], :order => 'created_at', :per_page => 5 )

SELECT * FROM `outgoing_sms_number_groups` WHERE (`outgoing_sms_number_groups`.`id` = 1)
---
  def show
    @outgoing_sms_number_group = OutgoingSmsNumberGroup.find(params[:id])

INSERT INTO `outgoing_sms_number_groups` (`group_name`, `created_at`, `updated_at`, `phone_numbers`) VALUES('Developers', '2010-05-16 16:30:03', '2010-05-16 16:30:03', '9382715551,9884468803')
---
  def create
    @outgoing_sms_number_group = OutgoingSmsNumberGroup.new(params[:outgoing_sms_number_group])

    respond_to do |format|
      if @outgoing_sms_number_group.save