SMSServerGui/app/controllers/report_controller.rb

SELECT count(1) AS count_1 FROM `smsserver_out_messages` WHERE (status='Q' or status='U' and create_date >= '2010-05-25 00:00:00' and create_date <= '2010-05-25 23:59:00')
---
  def outgoing_sms
    if request.get?
      @form_name =  "Outgoing SMS logs"
     render :action => "_form"
    else
        begin
        sdate = params[ :sdate ].to_datetime
        edate = params[ :edate ].to_datetime
       rescue
        session[ :error ] =  "Invalid Start date or/and End date...Please check"
        render :action => "_form"
        return 1
       end
       sdate_in_string  =  sdate.strftime( "%Y-%m-%d %H:%M:%S" )
       edate_in_string  =  edate.strftime( "%Y-%m-%d %H:%M:%S" )

         session[ :info ]  =  "Your criteria was From Date:<font color=\"green\">#{params[ :sdate ]}</font> To Date:<font color=\"green\">#{params[ :edate ]}</font>"

       @total_sms = SmsserverOutMessage.count( 1, :conditions => [ "create_date  >= ?  and create_date <= ?",sdate_in_string,edate_in_string ]  )

SELECT * FROM `smsserver_in_messages` WHERE (process=1 and receive_date >= '2010-05-25 00:00:00' and receive_date <= '2010-05-25 23:59:00') ORDER BY receive_date Desc LIMIT 0, 10
SELECT count(*) AS count_all FROM `smsserver_in_messages` WHERE (process=1 and receive_date >= '2010-01-01 00:00:00' and receive_date <= '2010-06-15 23:59:00')
---
  def incoming_sms

       @form_name =  "Incoming SMS logs"
    if  params[ :sdate ] and params[ :edate ]
        begin
        sdate = params[ :sdate ].to_datetime
        edate = params[ :edate ].to_datetime
        rescue
        session[ :error ] =  "Invalid Start date or/and End date...Please check"
        render :action => "_form"
        return 1
        end
       sdate_in_string  =  sdate.strftime( "%Y-%m-%d %H:%M:%S" )
       edate_in_string  =  edate.strftime( "%Y-%m-%d %H:%M:%S" )

       @received_sms = SmsserverInMessage.paginate( :all, :conditions => [ "process=? and receive_date  >= ?  and receive_date <= ?",1,sdate_in_string,edate_in_string ] ,:page => params[ :page ] , :per_page => 10 , :order => "receive_date Desc"   )

SELECT * FROM `smsserver_calls` WHERE (isread=1 and call_date >= '2010-05-25 00:00:00' and call_date <= '2010-05-25 23:59:00') ORDER BY call_date Desc LIMIT 0, 10
---
  def missed_call
    @form_name =  "Missed Call logs"
    if  params[ :sdate ] and params[ :edate ]
        begin
        sdate = params[ :sdate ].to_datetime
        edate = params[ :edate ].to_datetime
       rescue
        session[ :error ] =  "Invalid Start date or/and End date...Please check"
        render :action => "_form"
        return 1
       end

       sdate_in_string  =  sdate.strftime( "%Y-%m-%d %H:%M:%S" )
       edate_in_string  =  edate.strftime( "%Y-%m-%d %H:%M:%S" )

       @missed_calls = SmsserverCall.paginate( :all, :conditions => [ "isread=? and call_date  >= ?  and call_date <= ?",1,sdate_in_string,edate_in_string ] ,:page => params[ :page ] , :per_page => 10 , :order => "call_date Desc"   )

SELECT * FROM `smsserver_in_messages` WHERE (`smsserver_in_messages`.`id` = '9') LIMIT 1
---
  def get_record_by_id
      @received_sms = SmsserverInMessage.find_by_id( params[ :incoming ][ :id ] )